/*
〈注|内容|标题(可留空)〉 → <sup>[注]</sup> →点击→ <sup>(内容)</sup>
〈内容〉 → <span class='提示' data-msg='内容'>表面</span>
内容 可以引用let 注:
内容_内容2 “_内容2”会被隐藏

〈模糊|内容|提示〉 → 模糊效果
〈模糊|内容|剧透/内鬼〉 → 相关提示

〈zk|zk码|按钮|标题〉 → 如果没有标题则以按钮为标题

〈table|a1／a2／a3|b1／b2／b3〉
〈百分比|标题1／标题2／标题3|标题b1／数字／数字|标题c1／数字／数字〉

〈隐藏|内容|标题(可留空)〉 → 显示“标题” →点击→ 内容

〈li|标签〉
标签：米哈游其他游戏、?、存疑 会显示灰色小字
〈展开更多|标签／内容|标签2／内容2〉 //之前备注“其中不可以加＼”，但似乎加了也没问题？

［注＼内容］ ← 会转换为〈注|内容〉

〈粉丝|平台|粉丝数|年月|作品〉
〈获奖|平台|奖项|年月|作品〉
〈排行|<b>平台</b>榜单|<small>细则</small> 排名|年月|作品〉
〈热搜|年月|国家地区数|原因|作品〉

〈标题|标题文|说明〉 无需〈li〉
*/

let 注={
"原批":["对原神玩家的侮辱性称呼","/i/9562445"],
"OP":"对原神玩家的侮辱性称呼，“原批”的变种",
"第一定律":["反米梗，意为“当在网上看到奇葩言论，翻此人的账号一定能找到原神相关内容”","/i/14122835"],
"第一定律袭击":["反米势力以“第一定律”为由对原神玩家发动骚扰和网暴","/i/14122835"],
"KY":"指说话做事破坏气氛、没眼力见",
"缝合怪":"指将不同作品的内容缝合到一起",
"开盒":"通过人肉搜索等手段查出别人的隐私信息",
"盒战争":"争议双方把“开盒（人肉搜索）”当作武器攻击对方",
"空盒":"开盒的目标实际并不存在这个人",
"破防":"受到打击而崩溃",
"爬虫":"通过技术手段获取数据",
"米卫兵":"指无脑维护米哈游的网友",
"反串":"伪装成对方阵营发表实际上不利于对方的言论",
"CV":"配音",
"猴":"对反米群体的简称，贬义",
"二创":"对已有作品进行二次创作",
"岁月史书":"趁着别人都忘了或者不知情就直接颠倒黑白、篡改真相",
"整活":"以破坏秩序的方式取乐、吸引眼球",
"COS":"角色扮演",
"COSER":"扮演成角色的人",
"钟离":"原神角色，在游戏里是璃月地区的神失去神力后在人间的化身",
"可莉":"原神角色，游戏里设定是天真无邪的小女孩，深受原神玩家喜爱",
"蒙德":"以西欧为原型的城市",
"璃月":"以中国为原型的城市",
"稻妻":"以日本为原型的城市",
"原石":"原神里的货币，用于抽卡",
"原人":"不做主线，没解锁游戏的抽卡功能，只用最基础的角色进行游戏的玩法",
"常驻池":"原神卡池，有基础的五星角色和武器",
"限定池":"限定角色所在的卡池",
"粉球":"纠缠之缘，限定池抽卡道具",
"TGA":"The Game Awards，游戏界的奥斯卡",
"斗鱼":"直播平台",
"CJ":"ChinaJoy，中国国际数码互动娱乐展览会",
"BW":"BiliBili World，哔哩哔哩线下嘉年华",
"TGS":"东京电玩展，全球规模第二大的游戏展会",
"完美世界":"游戏公司，旗下作品有幻塔等",
"库洛":"游戏公司，由腾讯控股，旗下产品有战双、鸣潮等",
"IGN":"Imagine Games Network，全球规模最大的游戏娱乐媒体",
"IGN中国":"IGN的中国分部，由腾讯运营",
"快手":"短视频平台",
"幻塔":"完美世界旗下的游戏，国际服由腾讯运营",
"NS":"switch游戏机",
"PS":"PlayStation，索尼的游戏机",
"吉田修平":"索尼全球工作室总裁",
"极游组":"游戏区自媒体",
"NGA":["游戏论坛","/i/11473723"],
"MIHOYO吧":"名为米哈游，但已经被反米势力占领的贴吧",
"原神内鬼吧":["反米势力的贴吧","/i/12187843"],
"原神2吧":["百度贴吧，由于原神吧、mihoyo吧都被反米群体占据，原神玩家建立了新的贴吧用于交流游戏本身"],
"林克":"«塞尔达传说»主角",
"订阅制":"需要买点卡、月卡购买游戏时长的游戏",
"精日":"精神日本人，指极端崇拜日本军国主义、仇视本国的中国人",
"团建":"网友组团攻击别人",
"虚空打靶":"想象“敌人会做什么”并加以反对，实际这些事并不存在",
"月活":"月活跃用户人数",
"南山必胜客":"指腾讯法务部在南山区法院打官司屡战屡胜，甚至可以在毫无证据的情况下冻结知名品牌老干妈的上千万资产",
"东半球最强法务部":"指任天堂在全球四处征战且胜多败少，曾在还没什么名气时被环球影业起诉抄袭“大金刚”，任天堂胜诉，一战成名",
"NMSL":"“你妈死了”的拼音缩写",
"反米势力":["有组织有预谋的执行反米哈游行动的群体","/i/6795977"],
"主祭":["极端反明日方舟人士","/i/10143135"],
"狸子NEAZLE":["反米博主，自称游戏业内人士","/i/6804237"],
"四狗":["曾在原神展台摔碎自己的游戏机而成名","/i/6842152"],
"仙家军":["偏支持米哈游一方的暗区群体","/i/6804640"],
"舅舅":"指提前爆料未公开内容的人",
"鬼图":"反米群体喜欢传播的角色血腥、恐怖、恶心图片",
"尸块":"将角色分尸",
"石块":"谐音“尸块”，指将角色分尸",
"3DM":"曾经中国最大的盗版游戏网站，如今成了游戏资讯网站",
"百万塞尔达":"原神发布pv时一夜之间忽然冒出了许多“塞尔达玩家”制造舆论，数量远超游戏本身的热度",
"大伟哥":"米哈游创始人之一，刘伟",
"刘伟":"米哈游创始人之一，公司总裁",
"蔡浩宇":"米哈游创始人之一，公司董事长",
"DEMO":"样片",
"一粒米原则":"在反米群体看来，只要碰过米哈游的游戏，就算是“米哈游玩家”",
"拳头公司":"游戏开发商，代表作«英雄联盟»，已被腾讯收购",
"青沼英二":"任天堂的游戏设计师和制作人，代表作«塞尔达传说»",
"榎宫祐":"漫画家、小说家，代表作«游戏人生»",
"奈须蘑菇":"作家，“型月世界”的创设者，代表作«空之境界»、«Fate/stay night»",
"高原反应":"指反米群体看到原神相关就会异常激动的现象",
"原激化":"原神的一种元素反应，在舆论场里指反米群体看到原神相关就会非常激动的现象",
"绝区零":"米哈游开发的动作游戏",
"崩坏3":"米哈游开发的动作游戏",
"STN工作室":["游戏区自媒体","/i/8189510"],
"瓶子君":["动漫区up主","/i/8251746",1],
"肖战":"偶像明星，其粉丝曾因为不喜欢别人的二创作品发动大量举报，因而被许多群体厌恶",
"天罚":"恶意举报导致有关部门的严格审查",
"仓检":"检测玩家账号，玩家越需要什么道具、角色就越不给，让玩家不得不花更多时间",
"内鬼":["提前爆料未公开内容的人","/i/8355170"],
"内鬼厨":["追捧内鬼的人，甚至信内鬼而不信官方，为了内鬼骂官方","/i/8355170"],
"武汉肺炎":"新冠肺炎在被命名前被称为“武汉肺炎”，一些外国媒体喜欢用这个词来抹黑中国",
"EPIC":"游戏公司，开发了虚幻引擎，有游戏商城，经常免费赠送游戏",
"空":"原神的男主角",
"金翎奖":"国内的著名游戏奖项",
"文输":"“文化输出”的缩写，又可以说成是“输了”",
"菩萨":"网络用语“女菩萨”，指在网上发布性感照片或视频的女性",
"米忽悠":"米哈游的外号，略带贬义，也可能用作调侃",
"艾因代餐事件":"«绘旅人»官方画师照着原神角色钟离去画自家游戏角色艾因",
"O":"原神的简称，贬义",
"BERYL":"英雄联盟职业选手，出了名的沉迷原神、崩坏3等游戏，曾因比赛失利被嘲笑「玩原神玩的」，被冠以“原神哥”外号",
"心脏弱":"经常绘制原神二创的画师，因其独特的画风和有趣的剧情深受玩家喜爱",
"绿媒":"政治立场偏向于反华的台湾媒体",
"猎巫行动":"原指欧洲中世纪以“猎杀女巫”为借口对女性的大规模猎杀行动",
"恰烂钱":"指收钱办事，并且是赚黑心钱",
"恶意曲解":"恶意曲解剧情成恶心人的样子，或者按照现实中的法律道德评判虚拟角色",
"霜星碎片":"明日方舟玩家经常嘲笑原神角色是“尸块”，因此认为“霜星碎片”是对角色霜星的报复，意为“将霜星分尸成碎片”。",
"ZEG":"NGA论坛创始人之一",
"张栋":"网易高管，曾负责代理暴雪游戏，经常在网上发表锐评，现负责网易云音乐",
"自绿":"用恶意解读、曲解等方式，论证女角色与其他人有“奸情”、玩家被“戴绿帽子”",
"像素大战":"外网的网页活动，在一张非常巨大的画布上，用户们用像素点绘制图案",
"TAPTAP":"手机游戏平台",
"番鼠":["内鬼头子，靠搬运和传播内鬼消息、骂米哈游、侮辱角色赚取流量","/i/11765885"],
"流水":"营业额",
"数值膨胀":"新关卡和新角色的数值远高于以往，旧角色远不如新角色",
"里茶馆":"NGA论坛原神版块里的一个子版块，专门用于讨论“争议话题”，由于NGA的原神版块常年由反米人士管理，这里也就成了反米势力聚集地",
"快乐雪花吧":"由明日方舟玩家组成的贴吧，最初用于反抗那些反明日方舟的网友，也会反米",
"米孝子":"对米哈游玩家的侮辱性称呼，指对厂商如同孝子一般",
"MXZ":"／米孝子","米学长":"／米孝子","米小子":"／米孝子",
"孝子":"对用户的侮辱性称呼，指对厂商如同孝子一般",
"CP":"将两个角色说成是情侣关系",
"狂欢":"一种网络现象，群体会对某个事件或某个人的讨论热情高涨，甚至陷入疯狂",
"ML人":["认为游戏里女角色必须都喜欢主角（玩家）的群体","/i/11411748",1],
"终末地":"鹰角的游戏，«明日方舟»的续作",
"来自星尘":"鹰角的游戏",
"刘宝杰":"台湾主持人，“一定是米哈游干的”的梗图上就是他",
"吧友":"原意是“贴吧网友”，有时特指在贴吧的反米势力",
"鹰角":"游戏公司，代表作«明日方舟»",
"王国之泪吧":"百度贴吧“王国之泪吧”，在游戏发售前就被反米势力刷屏占领并反串嫁祸给原神玩家",
"小黑盒":"游戏相关app，包含游戏资讯、社区、资料库、商店等",
"陈雨欣":["一个反米人士","/i/10158706"],
"MEGALIA手势":["“一点点”手势，会被韩国网友认为是支持极端女权","/i/2475219"],
"利刃":"极端明日方舟玩家",
"卡车示威":"韩国网友常用的抗议手段，租一辆卡车，在车上写抗议语，在现场绕场",
"世界树WIKI":["反米势力建立的百科网站，用于收录反米话题、歪曲事实等","/i/9889636"],
"ZARD":"游戏主播，本名郑翔，网传因骂米哈游被做成NPC放进游戏里“看大门”",
"虎扑":"体育论坛",
"阿贞":"极端明日方舟玩家，知名博主，喜欢传播谣言反米",
"脸盆哥":["NGA用户，爆料了很多米哈游负面消息","/i/10298562"],
"米哈游社管":["网传米哈游有专门的员工负责监视管控各社区舆论","/i/11462451#社管"],
"刘照坤":"配音演员，«原神»荒泷一斗的配音",
"南风窗":"自称「中国最具影响力的新闻杂志」，核心价值观为「理性、良知、责任」，代表作“鲍毓明事件”",
"安利":"推荐",
"捏鼻人":"坚持玩原神，但不享受游戏乐趣，而是用恶意曲解等方式攻击官方、角色、其他玩家，常活跃于反米贴吧，喜欢看内鬼消息",
"角色厨":"非常喜欢某个角色的玩家，类似于角色粉丝",
"ZNG":"宅男哥，指一些反对游戏里出现讨好女玩家的设计（帅哥、卖腐等）的男玩家",
"XXN":"小仙女，指一些反对游戏里出现讨好男玩家的设计（性感、幼态等）的女玩家",
"圣经":"将一些奇葩、离谱的言论截图保存分享，说这是这个群体的“经典言论”",
"商单":"官方出钱的订单",
"内斗论":["网传米哈游高层内部不合，有许多关于他们内斗的故事，如「为了一个俄罗斯女高管争风吃醋」、「哪个项目是谁为了保住自己地位而研发的」","/i/10296745"],
"黑产论":"网传米哈游雇人开盒、网暴、骚扰反米网友",
"回旋镖":"为了踩米哈游把标准定的很高，反而害了别的游戏",
"时光机":"明明米哈游先出的，却被指抄袭别人，网友开玩笑「是真的，米哈游有时光机，提前抄袭」",
"NTR":"俗称的“被戴绿帽子”",
"强度党":"非常在意角色战斗力的群体，角色较弱、较强、战斗力与其他角色相似都可能导致他们不满",
"米蛆":"对米哈游玩家的黑称",
"朱铭骏":["因伤退役的消防员，高位截瘫只有头能动，走出阴霾后用嘴玩游戏，因玩了原神而遭到网暴","/i/10287114",1],
"逆天":"“脑瘫”的谐音",
"挂零":["流水没有超过抖音","/i/13996242"],
"眼镜叔叔":["音乐区up主，反米哈游，曾做视频“科普仙家军”","/i/11404349"],
"反串袭击":"装作原神玩家去别的社区搞破坏，甚至直接占据这个社区（如“王国之泪吧”），引发社区用户对原神的不满",
"李隽":"反华公知，似乎不太聪明，经常被网友戏弄",
"株式会社":"日语“有限公司”的意思，对国内公司用这个词是骂对方是“日本公司”",
"七圣":["仙家军模仿“五帝兽”，把一些他们觉得离谱的up主列为“*圣”","/i/11456246"],
"恶俗WIKI":"记录别人黑料、隐私信息的百科网站",
"社管":"官方暗中安排的社区管理，负责操纵舆论",
"炎枪哥":["NGA用户，爆料一些米哈游的内幕","/i/11462405"],
"李猛干":["网传是米哈游的编剧","/i/9563246"],
"CGTN":"中央电视台旗下的中国国际电视台新闻频道",
"篝火营地":"腾讯旗下的游戏媒体",
"米哈游员工":["-","/i/11462451"],
"兔女郎事件":["崩坏3的一段被恶意曲解的剧情，曾引发巨大争议","/i/8284790"],
"尘白禁区":["西山居的一款ML向二次元媚宅手游","/i/11574830"],
"木木":"«尘白禁区»的发行负责人，充当社管传达官方态度和支持玩家的社区争斗",
"烧鸡":"“骚+妓女”的谐音",
"烧鸡_编剧":"崩坏系列IP编剧",
"门酱":["反米博主，因符合人们对废宅刻板印象的长相，高喊“原神启动”火爆出圈","/i/11604563"],
"嘉然":["虚拟偶像，因经常玩“OP”梗，反米群体普遍很喜欢她","/i/11618957"],
"黑红营销":"故意制造负面新闻博眼球的营销方式",
"月飞大叔":["B站主播，自称业内人士，“游戏行业与玩家沟通的桥梁”","/i/11660147"],
"硬核联盟":"华为等手机品牌组成的渠道服联盟，游戏在它们的渠道上架需要高额分成",
"羽中":"«少女前线»制作人",
"纯初文化":"由网易百分百持股的二次元MCN机构",
"皮套":["指主播的虚拟形象。在节奏中是反米群体传播的一种观点：角色是米哈游员工以自己为原型设计的私人角色。以此降低玩家对角色的好感、用剧情证明内斗论等","/i/10296745#皮套论",1],
"皮套论":["指主播的虚拟形象。在节奏中是反米群体传播的一种观点：角色是米哈游员工以自己为原型设计的私人角色。以此降低玩家对角色的好感、用剧情证明内斗论等","/i/10296745#皮套论",1],
"卖肉":"出卖色相、肉体赚钱",
"环球时报":"人民日报旗下的向国外传达符合中国基本国情的综合新闻报媒",
"?_3A":"国内玩家通常不承认作为持续运营游戏和二次元画风的原神是3A游戏",
"仙帝":["反米人士，开盒原神玩家发现对方家长是律师后光速道歉，吸引来许多乐子人把他当笑话捧着玩，自称‘追随仙帝的仙家军’","/i/6804640"],
"暗区":"二游社区中，喜欢批评和辱骂游戏、厂商、玩家的群体的聚集区",
"二游":"广义指二次元文化的游戏，狭义指“二游圈”认可的二次元游戏，通常是美少女抽卡手游",
"有男不玩":"ML人群体搞出来的口号，对游戏里出现男性角色的抗议",
"欧皇号":"玩家认为不同账号的获取稀有道具概率不一样，有的账号比别人更高",
"天华":["米游up主，被反米群体认为是“仙家军头子”","/i/11868422"],
"木之白":["反米、反仙家军人士","/i/11878424"],
"ZZZ纸盒":["库洛员工，«鸣潮»项目组","/i/11954328"],
"还原神作":["讽刺原神抄袭的梗"],
"福瑞":["拟人的动物角色"],
"SBI":"外国女权组织，会要求游戏公司花钱向她们资讯如何让游戏更“包容”，其实就是收保护费，还要把女角色改丑，不照做就抹黑游戏",
"白夜极光":"腾讯旗下的魔幻策略战棋消除手游",
"散兵":["原神角色，又名流浪者","/i/11556332"],
"CP党":["喜欢看两个角色谈恋爱，哪怕角色在原著里并没有交集也可以脑补他们的恋爱关系"],
"清榜":["在应用商城出现严重违规，被清除出排行榜"],
"故意开假盒":["","/i/12140109"],
"禁潮令":["网传米哈游禁止博主玩«鸣潮»","/i/11656013#禁潮令"],
"畜牧业":["厂商通过营销和洗脑，驯化玩家"],
"散草CP":["一些反米势力喜欢编造纳西妲和散兵的恶俗段子，用于恶心玩家"],
"米八团":["以up主“米八”为首的通过抹黑、网暴米哈游员工获取流量带货赚钱的团队","/i/12286749"],
"暗限流":["被平台限制流量，但不告知"],
"米池":["部分米游使用的卡池规则：每抽基础概率低、90抽保底、出金可能会歪出非限定角色","/i/12630595"],
"环大陆好评圈":["原神上线的前几年，中国大陆受反米势力带节奏和制造信息茧房，导致原神风评极差，但在中国大陆以外的国家和地区却截然相反"],
"袈裟":["奖项和荣誉都只是执念、虚名、贪欲，就像金池长老的袈裟"],
"OC":["原创角色、自设"],
"NERUMERO":["日本游戏主播","/i/13539882"],
"SAG大罢工":["美国演员公会牵头发起的罢工","/i/14324260"],
"兔爪流":["利用B站给«原神»视频限流、给黑«原神»视频推流的机制，做«原神»视频但取一个看似黑«原神»的标题"],
"安可酱":["«鸣潮»up主，“文化让路”作者","/i/13592406"],
"凌阳宝宝":["创建多个账号冒充成米游up主，目前已知有克苟、眼镜妹妹、依和p"],
"采访哥":["自称认识很多业内人士，以“采访”的名义传播有关米哈游的“内幕”","/i/12289588"],
"DEI":["西方的多元化政治正确计划"],
"PIXIV":["全世界最著名的二次元插画平台"],
"反米至上":["对一些人来说，反米的优先级高于自己原本的一切立场"],
"自充":["游戏公司给自己的游戏充值，为了让商业成绩更好看","/i/13996242"],
"414":"死一死",
"穹P":"对星穹铁道玩家的侮辱性称呼",
"北落野吧":"«鸣潮»玩家的贴吧",
"深渊":"周期性的较高难度爬塔副本",
"蔡喵":"米哈游创始人之一，蔡浩宇",
"潇潇枫汐":["反米领袖之一","/i/14438528"],
"三颗纠缠之缘":"反米节奏，造谣说原神周年庆只送玩家三抽，并借此嘲笑原神玩家",
"奉旨爆料":"一种阴谋论，说官方会自己雇佣内鬼爆料，用于自我炒作",
"OOC":"同人创作时，角色做出不符合原作设定的事",
"内部恨":"制作组内部对某一角色有私仇，故意做出对角色不利的设计和安排",
"分裂派":["试图破坏米哈游旗下各游戏玩家团结的群体，包含反米群体和受节奏影响的单游戏玩家","/i/14636827"],
"鬼叔黍":["反米博主，据说是白手起家的亿万富翁","/i/12372953"],
"鸡厂":["","/i/14745139"],
"摄像头":"剧情在讲配角的故事，玩家只负责见证，就像一个“摄像头”",
"鸣式双厨狂喜":["一些疑似商单的二创，会让米游角色穿越到«鸣潮»世界，说是过上了“更好”的生活，让米游玩家不爽，但«鸣潮»玩家认为是“双厨狂喜”","/i/11656013#双厨狂喜"],
"鸣式赢学":["«鸣潮»玩家和营销号用各种方式论证«鸣潮»赢了","/i/14858847"],
// "":["",""],

// "A":"／b", //使用b的解释
// "":["内容","链接",1(只看)]",
}

let 代码={
// "真":"<span 真></span>","假":"<span 假></span>",
// "真":"🎯","假":"🎭",
"灰字":["存疑","黑料","米哈游","崩坏学园","崩坏学园2","崩坏3","人工桌面","原神","未定事件簿","星穹铁道","绝区零","星布谷地","米游社",],
}
let 事件_只看=[
["黑暗","<b>黑暗降临</b>"],
["趣闻","小趣闻"],
["br"],
["黑料","疑似和实锤的<b>黑料</b>"],
["br"],
["抄袭","<b>抄袭</b>指控"],
["反米线下行动","反米线下行动"],
["团建","线上团建"],
["br"],
["外网","<b>外网</b>的节奏和事件"],
["友商","<b>友商</b>相关"],
["br"],
["全部","<b>全部</b>"],
];
let 官号={
"崩坏3微博":"https://weibo.com/benghuai3","崩坏3B站":"https://space.bilibili.com/27534330",

"原神B站":"https://space.bilibili.com/401742377","原神微博":"https://weibo.com/6593199887","原神抖音":"https://www.douyin.com/user/MS4wLjABAAAAw6_Jq4rDqlUKujFUvw0mjwTE8Y4uYuqJoKIQWO43oBYTd5_FlhU3qZ-PbOS7MP35",
"原神Twitter":"https://x.com/GenshinImpact","原神日本Twitter":"https://x.com/Genshin_7","原神YouTube":"https://www.youtube.com/c/GenshinImpact",


"星穹铁道微博":"https://weibo.com/u/7643376782","星穹铁道B站":"https://space.bilibili.com/1340190821",
"星穹铁道Twitter":"https://x.com/houkaistarrail","星穹铁道YouTube":"https://www.youtube.com/@HonkaiStarRail",

"绝区零微博":"https://weibo.com/u/7632078520","绝区零B站":"https://space.bilibili.com/1636034895",
"绝区零Twitter":"https://x.com/ZZZ_EN","绝区零日本Twitter":"https://x.com/ZZZ_JP","绝区零YouTube":"https://www.youtube.com/@ZZZ_Official",
}

let dy,内容,分={},得分=[],粉丝=[],粉={},丝=[],获奖=[],排行=[],热搜=[],事件={"全部":0},在线=1,盒=[],临时0,角色={};
if(window.location.href.indexOf("file:///")!=-1){在线=0}

let 执行a={
"注":(o,i)=>{let 临时2=临时0[1].toUpperCase();临时0[2]=临时0[2]||"注";dy+="<sup id='隐藏"+o+i+"' style='display:none;'>(";if(注[临时2]){if(注[临时2][0]=="／"){临时2=注[临时2].split("／")[1]}dy+=临时0[1].split("_")[0]+":";if(typeof 注[临时2]=="object"){dy+=注[临时2][0].split("_")[0]+" <a href='"+注[临时2][1]+"'>链接</a>"}else{dy+=注[临时2].split("_")[0]}}else{if(临时0[2]!="注"&&临时0[2]!="?"&&临时0[2]!="详"){dy+=临时0[2]+":"}dy+=临时0[1]}dy+=")</sup><sup id='显示"+o+i+"' class='注' onclick=\"显示('"+o+i+"')\">["+临时0[2]+"]</sup>"},
"注2":(o,i)=>{临时0[1]=临时0[0].toUpperCase();if(注[临时0[1]]){if(注[临时0[1]][0]=="／"){临时0[1]=注[临时0[1]].split("／")[1]}
if(typeof 注[临时0[1]]=="object"){dy+="<span class='提示' data-msg='"+注[临时0[1]][0]+"'>"+临时0[0].split("_")[0];if(注[临时0[1]][1]&&注[临时0[1]][1]!=""){dy+="<sub class='详'><a href='"+注[临时0[1]][1]+"'>详</a></sub>"}if(注[临时0[1]][2]&&注[临时0[1]][2]!=""){dy+="<sub class='详'><a href='?"+临时0[1]+"'>👁️‍🗨️</a></sub>"}dy+="</span>";
}else{dy+="<span class='提示' data-msg='"+注[临时0[1]]+"'>"+临时0[0].split("_")[0]+"</span>"}}else{dy+=临时0[0];console.log(临时0[0])}},
"隐藏":(o,i)=>{临时0[2]=临时0[2]||"详情";dy+="<span id='隐藏"+o+i+"' style='display:none;'><fieldset><legend>"+临时0[2]+"</legend>"+临时0[1]+"</fieldset></span><a id='显示"+o+i+"' onclick=\"显示('"+o+i+"')\">"+临时0[2]+"▿</a>"},
"图片":(o,i)=>{if(临时0[1].indexOf(".")!=-1){}else{临时0[1]+=".jpg"}if(!临时0[2]){临时0[2]="图片"}if(!临时0[3]){临时0[3]="300px"}dy+="<a id='显示"+o+i+"' onclick=\"显示图片('"+o+i+","+临时0[1]+","+临时0[3]+"')\">"+临时0[2]+"▿</a>"},
"只看":(o,i)=>{dy+="<small><a onclick=\"只看('"+临时0[1]+"')\">👁️‍🗨️</a></small>"},
"官方":(o,i)=>{dy+="<span class='lantie'>「"+临时0[1]+"」</span>"},
"li":(o,i)=>{if(!临时0[1]){临时0[1]="li"}let 临时3=临时0[1].split(" ");for(let i2=0;临时3.length>i2;i2++){if(事件[临时3[i2]]){事件[临时3[i2]]+=1}else{事件[临时3[i2]]=1}}事件["全部"]+=1;dy+="<li class='"+临时0[1]+"'>";if(临时0[1]){let 临时3=临时0[1].split(" ");if(临时3.indexOf("?")!=-1){dy+="<small class='灰'>存疑</small> "}for(let i3=0;代码["灰字"].length>i3;i3++){if(临时3.indexOf(代码["灰字"][i3])!=-1){dy+="<small class='灰'>"+代码["灰字"][i3]+"</small> "}}}},
"粉丝":(o,i)=>{if(丝.indexOf(临时0[4]+临时0[1])!=-1){粉[临时0[4]+临时0[1]]=临时0[2].split("万")[0]}else{丝[丝.length]=临时0[4]+临时0[1];粉[临时0[4]+临时0[1]]=临时0[2].split("万")[0]}粉丝[粉丝.length]=[临时0[1],临时0[2],临时0[3],临时0[4]];dy+=临时0[4]+"在"+临时0[1]+"粉丝数达到"+临时0[2]+"。"},
"dy_粉丝":(o,i)=>{dy+="<span id=\"粉丝_style\"></span><table class='粉丝 首小1'><tr><td colspan='3'><b>粉丝数</b> <small>点击高亮同作品</small></td></tr>";for(let i2=0;粉丝.length>i2;i2++){dy+="<tr><td>"+粉丝[i2][2]+"</td><td onclick=\"排行高亮('粉丝_"+粉丝[i2][3]+"')\" class='粉丝_"+粉丝[i2][3]+"'><small>"+粉丝[i2][3]+" </small>";if(粉[粉丝[i2][3]+粉丝[i2][0]]+"万"==粉丝[i2][1]&&官号[粉丝[i2][3]+粉丝[i2][0]]){dy+="<a href='"+官号[粉丝[i2][3]+粉丝[i2][0]]+"' target='_blank'>"+粉丝[i2][0]+"</a>"}else{dy+=粉丝[i2][0]}dy+="</td><td onclick=\"排行高亮('粉丝_"+粉丝[i2][3]+"')\" class='粉丝_"+粉丝[i2][3]+"'>";if(粉[粉丝[i2][3]+粉丝[i2][0]]+"万"==粉丝[i2][1]){dy+="<b>"+粉丝[i2][1]+"</b>"}else{dy+=粉丝[i2][1]}dy+="</td></tr>"}粉["粉丝数"]=0;for(let i2=1;丝.length>i2;i2++){粉["粉丝数"]+=粉[丝[i2]]*1}dy+="<tr><td colspan='3' style='text-align:right'><small>各平台 共</small> <b>"+粉["粉丝数"]+"万</b></td></tr></table>"},
"获奖":(o,i)=>{获奖[获奖.length]=[临时0[1],临时0[2],临时0[3],临时0[4]];dy+=临时0[4]+"荣获"+临时0[1]+"：<b>"+临时0[2]+"</b>。"},
"dy_获奖":(o,i)=>{dy+="<table class='获奖 首小1 首小2'><tr><td><b>获奖</b></td><td></td><td>活动</td><td>奖项</td></tr>";for(let i2=0;获奖.length>i2;i2++){dy+="<tr><td>"+获奖[i2][2]+"</td><td>"+获奖[i2][3]+"</td><td>"+获奖[i2][0]+"</td><td>"+获奖[i2][1]+"</td></tr>"}dy+="</table>"},
"排行":(o,i)=>{排行[排行.length]=[临时0[1],临时0[2],临时0[3],临时0[4]];dy+=临时0[4]+"登上"+临时0[1]+"：<b>"+临时0[2]+"</b>。"},
"dy_排行":(o,i)=>{dy+="<span id=\"排行_style\"></span><table class='首小1 首小2'><tr><td><b>排行</b></td><td></td><td>项目 <small>点击高亮同名榜单</small></td><td>名次</td></tr>";for(let i2=0;排行.length>i2;i2++){let 临时3=排行[i2][0].replace(new RegExp('[<>/]',"g"),"").replace(new RegExp(' ',"g"),"_");dy+="<tr><td>"+排行[i2][2]+"</td><td>"+排行[i2][3]+"</td><td class=\"排行_"+临时3+"\" onclick=\"排行高亮('排行_"+临时3+"')\">"+排行[i2][0]+"</td><td class=\"排行_"+临时3+"\" onclick=\"排行高亮('排行_"+临时3+"')\">"+排行[i2][1]+"</td></tr>"}dy+="</table>"},
"热搜":(o,i)=>{热搜[热搜.length]=[临时0[1],临时0[2],临时0[3],临时0[4]];dy+=临时0[4]+"在"+临时0[2]+"国家/地区登上热搜，热搜原因："+临时0[3]+"。"},
"模糊":(o,i)=>{if(临时0[2]=="剧透"){dy+="<small class='灰'>可能剧透:</small>"}else if(临时0[2]=="内鬼"){dy+="<small class='灰'>暂未证实，可能剧透或者是假消息:</small>"}else if(临时0[2]){dy+="<small class='灰'>"+临时0[2]+":</small>"}dy+="<span class='mohumu'>"+临时0[1]+"</span>"},
"table":(o,i)=>{dy+="<table>";for(let i2=1;临时0.length>i2;i2++){dy+="<tr>";let 临时3=临时0[i2].split("／");for(let i3=0;临时3.length>i3;i3++){if(i3!=0){dy+="</td>"}dy+="<td>"+临时3[i3]}dy+="</td></tr>"}dy+="</table>"},
"百分比":(o,i)=>{dy+="<table><tr>";let 临时3=临时0[1].split("／");for(let i2=0;临时3.length>i2;i2++){dy+="<td>"+临时3[i2]+"</td>"}dy+="</tr>";for(let i2=2;临时0.length>i2;i2++){临时3=临时0[i2].split("／");dy+="<tr><td>"+临时3[0]+"</td>";let 临时4=0;for(let i3=1;临时3.length>i3;i3++){临时4+=临时3[i3]*1}for(let i3=1;临时3.length>i3;i3++){dy+="<td>"+临时3[i3]+"<br>("+(临时3[i3]/临时4*100+"").split(".")[0]+"%)</td>"}dy+="</tr>"}dy+="</table>"},
"zk":(o,i)=>{if(!临时0[2]){临时0[2]="详情"}if(!临时0[3]){临时0[3]=临时0[2]}if(在线==0){dy+="<a onclick=\"dw(dwb='')\" href='zk/"+临时0[1].split("#")[0]+".html";if(临时0[1].indexOf("#")!=-1){dy+="#"+临时0[1].split("#")[1]}dy+="'>"+临时0[2]+"</a>"}else{dy+="<a onclick=\"dw(dwb='"+临时0[1].split("#")[0]+"',dwd='"+临时0[3]+"'";if(临时0[1].indexOf("#")!=-1){dy+=",dwe='#"+临时0[1].split("#")[1]+"'"}dy+=")\">"+临时0[2]+"</a>"}},
"展开更多":(o,i)=>{let 临时3="";let 临时4="";for(let i2=1;临时0.length>i2;i2++){if(临时0[i2].indexOf("／")!=-1){临时0[i2]=临时0[i2].split("／");if(临时0[i2][0]!=""){if(i2!=1){临时3+=" "}临时3+=临时0[i2][0]}临时4+="〈li|"+临时0[i2][0]+"〉<small class='灰'>";临时4+="</small> "+临时0[i2][1]+"</li>"}}dy+="<li class='"+临时3+"' id='原其他"+o+i+"'><a onclick=\"展开其他('"+o+i+"')\">"+临时0[0]+"</a> 〈注|影响力或知名度并不高的事件|?〉</li><div style='display:none;' id='其他"+o+i+"'>"+临时4+"</div>"},
// "dy_热搜":(o,i)=>{dy+="<h4>热搜记录</h4><small>1.上热搜过于频繁，低于10个国家/地区就不记录了。<br>2.由于某些原因我无法亲自统计外国热搜信息，这里的数据都来源于其他网友总结，可能不全或有误，请自行辨别。<br>3.我有时候可能会忘了还有这个记录……</small><table><tr><td><small>时间</small></td><td></td><td><small>国家/地区</small></td><td><small>上热搜原因</small></td></tr>";for(let i2=0;热搜.length>i2;i2++){dy+="<tr><td><small>"+热搜[i2][0]+"</small></td><td><small>"+热搜[i2][3]+"</small></td><td>"+热搜[i2][1]+"</td><td>"+热搜[i2][2]+"</td></tr>"}dy+="</table>"},
"dy_事件":(o,i)=>{dy+="<h4>事件数量</h4>";for(let i2=0;事件_只看.length>i2;i2++){if(事件_只看[i2][0]!="br"){dy+=事件_只看[i2][1]+"："+事件[事件_只看[i2][0]]+"条<small>（"+(事件[事件_只看[i2][0]]/事件["全部"]*100+"").split(".")[0]+"%）</small><br>"}}},
"dy_只看":(o,i)=>{for(let i2=0;事件_只看.length-1>i2;i2++){if(事件_只看[i2][0]=="br"){dy+="<br>"}else{dy+="<a onclick=\"只看('"+事件_只看[i2][0]+"')\">"+事件_只看[i2][1]+"</a>　"}}},
"dy_css":(o,i)=>{if(在线==0){dy+="<link rel=\"stylesheet\" href=\"/css/all.css\">"}},

"dy_头":()=>{dy+=`<a name="相关事件"></a><h2>相关事件</h2><ol>
<li>事件顺序不一定按时间排序，因为我也不清楚这些事件的具体时间。<br>
    最初是因为原神才开始做这个页面，前期会按照原神的版本划分，2025年的新版本刚好从1月1日开始，那正好从2025年开始按月划分了。</li>
<li>以记录为主，不能保证完全准确，我会尽可能查证，标记为“〈真〉”是查证过基本可以确定为真的，“〈假〉”为确定的假消息。<br>
    如有错漏欢迎指正和补充，QQ:<a onclick="复(制='123719932')">123719932</a>。</li>
<li>不记录〈暗区〉的小规模争斗，太多太杂，而且很无聊，只记录影响较大或波及到普通玩家的。</li>
<li>从2025年开始，一些几乎每次都会有的“例行节奏”就不一一记录了，只在年初统一记录整理，除非影响太大或有什么特别之处，。</li>
<li>不用怀疑我的身份，本网页纯个人兴趣，本人与米哈游无关，无恰饭，只有网友自发打赏，收益完全赶不上我耗费的时间和精力。</li>
<li>辟谣和个人看法会用绿色文字标注：<span class='zhushi'>就像这样</span>（<a onclick="document.getElementById('隐藏标注').innerHTML='<style>.zhushi{display:none}</style>'">隐藏</a> / <a onclick="document.getElementById('隐藏标注').innerHTML=''">显示</a>）</li>
</ol>

<br>

“你对这些事件是什么看法？”<br>
<a href="/i/10246092">我的看法</a><br>
<br>

如果不喜欢我这个风格，还有其他“史官”可选：<br>
“我想看支持米哈游的”👉<a href="https://www.bilibili.com/read/cv5189274">原神往事</a>、<a href="https://zhuanlan.zhihu.com/p/447860817">原神往事II</a>、<a href="https://zhuanlan.zhihu.com/p/569536891">原神往事III</a>、<a href="https://space.bilibili.com/1903716905/lists/541588?type=series">版本节奏史</a> <small>等（<a href="/i/11654881">其他</a>）</small><br>
“我想看反对米哈游的”👉<a href="https://space.bilibili.com/3196602/article">原神玩家集体记忆名录</a><small>(大</small><span class="redX"><small>翻译运动)</small></span><small>（<a href="https://space.bilibili.com/1054756248">小号1</a>.<a href="https://space.bilibili.com/300827055">小号2</a>.<a href="https://space.bilibili.com/4806579">小号3</a>）</small>、<a href="https://hoyo.life">世界树</a><small>（<a href="https://irminsul-dup.github.io">新站</a>）</small>、<a href="/i/6795977#其他账号">其他反米势力</a><br>
“我想保持中立”👉暂时没见到完全中立的史官 <span class='zhushi'>毕竟按照〈一粒米原则〉只要玩原神就是“〈OP〉”了，所以没有人能在不是OP的同时客观了解原神</span><br>
<br>

<a href="/i/11654881"><b>资料来源</b></a><br>
<a href="/i/10246092?26">这些年发生了什么？</a><small>（节奏事件概述）</small><br>
<a href="/wbiji/game/geng">社区梗</a><br>
<a href="/i/7599677">其他游戏节奏</a><br>

<hr>

<a name="只看特定内容"></a><b>只看特定内容</b>：<small id="只看已选">（可多选）</small><br>
〈dy_只看〉
<small><a href="#关键词">更多关键词</a></small><br>`},

"dy_尾":()=>{dy+=`
<a name="最新"></a>
<a name="其他记录"></a><h2>其他记录</h2>
<a href="/i/12610579">本页的修改记录</a><br>

<br>

<h4>专题研究</h4>
<a href="/i/11431911">米游评分</a><br>
<a href="/i/11499319">对角色的评价</a><br>
<a href="/i/13537564">中国游戏史上的光明与黑暗</a><br>

<br>

<h5>群体</h5>
<a href="/i/11504341">支持者和反对者名单</a><br>
<a href="/i/7396705">米黑和米白的类型研究</a><br>
<a href="/i/6804640">仙家军</a><br>
<a href="/i/6795977">反米势力</a><br>
<a href="/i/11411748">ML人</a><br>
<a href="/i/11798555">对比舆论对米哈游和其他游戏的区别</a><br>

<br>

<h5>话题</h5>
<a href="/i/12140484">盒战争</a><br>
<a href="/i/12275596">“XXN污染二游圈”</a><br>
<a href="/i/11656013">库洛商战</a><br>

<br>

<h4>留档</h4>
<a href="/i/8584394">古战场记录与考古</a><br>
<a href="/i/14618416">反米势力传播的“合集”</a><br>
<a href="/i/8317226">一些截图</a><br>
<a href="/i/7638302">反米圣经</a>〈?|圣经|?〉<br>

<br>

<h4>其他</h4>

<a href="/game/chaoshen">«超神»</a>：许多人因为各种各样的原因给«原神»差评，比如没有跳过键、媚宅、苹果不能用弓箭射下来、不够自由……因此做出了这个符合“玩家”们喜好的游戏。<br>
<a href="/i/11462451">米哈游员工</a><br>

<br>

〈隐藏|
<a href="/i/7116753">2022年年末的一些舆情调查</a><small>（网友对米哈游相关节奏的真假判断、崩坏3摩托车、B站相关账号粉丝群体的反米程度）</small><br>
<a href="/i/10323198">二游二创观察<small>（2023年12月）</small></a><br>
|其他记录〉<br>

〈隐藏|
<a href="/i/7673525">原神相关推荐</a>：官方视频和二创<br>
我的抽卡记录：<a href="/i/7677616">原神</a>、<a href="/i/8508017">星穹铁道</a>、<a href="/i/12007576">绝区零</a><br>
<a href="/i/7567493">备忘</a><br>
<b>我的收藏和打分</b>：<a href="/pingfen/youxi?w=米哈游">游戏</a> . <a href="/pingfen/duanpian?w=米哈游">短片</a> . <a href="/pingfen/yugao?w=米哈游">预告片</a> . <a href="/pingfen/gequ?w=米哈游">歌曲</a> . <a href="/pingfen/peiyue">配乐</a> . <a href="/pingfen/ecylp">老婆</a><span class='zhushi'>打分非常主观，请不要在意</span><br>
|个人内容〉<br>
<br>

<hr>
<a name="关键词"></a><h4>关键词</h4>
〈dy_只看〉<br>
以下点击<small>(👁️‍🗨️)</small>只看特定内容：<small id="只看已选2">（可多选）</small><br>

<b>米哈游</b>〈只看|米哈游〉<br>
<b>«崩坏学园»</b>〈只看|崩坏学园〉、
<b>«崩坏学园2»</b>〈只看|崩坏学园2〉、
<b>«崩坏3»</b>〈只看|崩坏3〉<br>
<b>«未定事件簿»</b>〈只看|未定事件簿〉<br>
<b>«原神»</b>〈只看|原神〉、
<b>«星穹铁道»</b>〈只看|星穹铁道〉、
<b>«绝区零»</b>〈只看|绝区零〉<br>

<b><sub>个人标记：</sub></b>　<br>
<b>★</b>〈只看|★〉<small>：个人认为值得一看的内容，比如有一定知名度、标志性事件、过于恶劣的事件等。</small><br>

<b><sub>群体：</sub></b>　<br>
<b>〈内鬼〉</b>〈只看|内鬼〉<br>
<b>〈反串〉</b>〈只看|反串〉<br>
<b>〈角色厨〉</b>〈只看|角色厨〉 / <b>〈强度党〉</b>〈只看|强度党〉<br>
<b>〈ZNG〉</b>〈只看|ZNG〉 / <b>〈XXN〉</b>〈只看|XXN〉 <span class='zhushi'>我知道有些词是黑称，但实在是找不到更中立的叫法……</span><br>

<b><sub>类型：</sub></b>　<br>
<b>文化输出</b>〈只看|文化输出〉 / <b>文化送出</b>〈只看|文化送出〉<br>
<b>〈恶意曲解〉</b>〈只看|恶意曲解〉<br>
<b>米游要完</b>〈只看|米游要完〉<br>
<b>古神之名</b>〈只看|古神之名〉<small>：如同克苏鲁古神一样，不可提起祂的名字。</small><br>
<b>〈反米至上〉</b>〈只看|反米至上〉<br>
<b>召唤〈天罚〉</b>〈只看|召唤天罚〉 / <b>政治敏感</b>〈只看|政治敏感〉<br>
<b>盗版</b>〈只看|盗版〉<small>：私服、外挂等。</small><br>
<b>被抄袭</b>〈只看|被抄袭〉<br>

<b><sub>平台：</sub></b>　<br>
<b>知乎</b>〈只看|知乎〉、<b>NGA</b>〈只看|NGA〉、<b>B站</b>〈只看|B站〉<br>
<b>媒体</b>〈只看|媒体〉<br>

<b><sub>友商：</sub></b>　<br>
<b>网易</b>〈只看|网易〉<br>
<b>腾讯</b>〈只看|腾讯〉<br>
<b>完美世界</b>〈只看|完美世界〉<small>：幻塔 等</small><br>
<b>西山居</b>〈只看|西山居〉<small>：剑网三、〈尘白禁区〉 等</small><br>
<b>鹰角</b>〈只看|鹰角〉<small>：明日方舟、来自星尘 等</small><br>
<b>库洛</b>〈只看|库洛〉<small>：战双帕弥什、鸣潮 等</small><br>
<b>任天堂</b>〈只看|任天堂〉<small>：塞尔达传说、宝可梦 等</small><br>
<b>最终幻想</b>〈只看|最终幻想〉<br>

<b><sub>其他：</sub></b>　<br>
<b>〈回旋镖〉</b>〈只看|回旋镖〉<br>
<b>〈时光机〉</b>〈只看|时光机〉<br>
<b>“内幕”</b>〈只看|内幕〉<br>
<b>〈内斗论〉</b>〈只看|内斗论〉<br>
<b>商战</b>〈只看|商战〉<br>
<b>〈社管〉</b>〈只看|社管〉<br>

<a onclick="this.style.display='none';this.nextElementSibling.style.display='inline'">更多</a><fieldset style="display:none;"><legend>更多</legend>
<b>〈鬼图〉</b>〈只看|鬼图〉<br>
<b>〈开盒〉</b>〈只看|开盒〉<br>
<b>〈第一定律〉</b>〈只看|第一定律〉<br>
</fieldset>

<hr>

<br><a name="粉丝数"></a>〈dy_粉丝〉<br>
<br><a name="获奖"></a>〈dy_获奖〉<br>
<br><a name="排行"></a>〈dy_排行〉
`},

"dy_注意":()=>{dy+=`<h3 class="D">注意！</h3><br>
本页记录了大量充满恶意的内容，包括反米势力制造的谣言、对游戏和玩家的辱骂和污蔑、恶意曲解剧情等，强烈建议普通玩家只享受游戏就好，不要关注节奏事件，可能影响心情和游戏体验，请谨慎考虑是否要继续阅读。<br>
<small><a href="/i/10246092?46">我被节奏影响了心情怎么办？</a></small><br>`},

"假":(o,i)=>{if(临时0[1]){dy+="<span class='提示 "+临时0[0]+"' data-msg='"+临时0[1]+"'>["+临时0[0]+"]</span>"}else{dy+="<span class='"+临时0[0]+"'>["+临时0[0]+"]</span>"}},
"真":"假",
"标题":(o,i)=>{临时0[2]=临时0[2]||"";dy+="<li class='标题'><span class='标题'># "+临时0[1]+"</span> "+临时0[2]+"</li>";},
// "":(o,i)=>{临时0[1]},
"?":"注","剧透":"模糊"}

function 加载(o){
if(o!=""){
    内容=dy.split("〈");
}else{
    内容=document.getElementById("内容").innerHTML;
    内容=内容.split("〈");
}
    dy=内容[0];
for(let i=1;内容.length>i;i++){
    let 临时=内容[i].split("〉");
    临时0=临时[0].split("|");

if(执行a[临时0[0]]){if(typeof 执行a[临时0[0]]=="string"){执行a[执行a[临时0[0]]](o,i)}else{执行a[临时0[0]](o,i)}}

else if(!临时0[1]&&临时0[0]!="li"&&临时0.length==1){
    执行a["注2"](o,i)
    if(临时0[0]=="注2"||注[临时0[0].toUpperCase()]){}else{console.log(临时0[0])}
}else{
    dy+=临时0[0]+" "+临时0[1];
    console.log(临时0)
}
dy+=临时[1];
}
dy=dy.replace(new RegExp('＼',"g"),"|").replace(new RegExp('［',"g"),"〈").replace(new RegExp('］',"g"),"〉");
if(o!=""){document.getElementById("内容").innerHTML=dy}

if(o=='c'){document.getElementById("加载中").innerHTML=`<style>
:root{--灰:#a1a1a1}
body{cursor:url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABsAAAAbCAMAAAC6CgRnAAACSVBMVEUAAADkvT3///7uy0j////39+3duTv+/vr+/vvryEH+/v/xy0L4+O3xzUPfsDjxzEP9/fr9/fv////+/vzzz0T////xzUPv793wzEL////xzUPXrTf19ej////lszrerDf09OT////////jsjv////drDj09OfTnQ7isw3gsTrdrDf6+vLx8eD39+zxzUPxzEP////drTfxzEP////////mxT7////z8+T19en////t7dbivDvJoSXbujfxzkP4+O7pwEX3003////juTz////8/Pjy8uTYrzjz8+T+/vz////w58fx6L/atDv////SpTT5+fDftQ/Nngz////////29uvZsjrQpjby8uTcszjz8+r////6+vT////orTj09OXprTjy8uD29urqrzn4+PDx8eLv79vrtjrwxED39+z19efwwD7tsjrorDjssDrrsTnjoBD3//71+/f6+vPz+PLr69Lq6tD0v1DuuUvzy0LutkC8hhrIhgL7+/n1+PD3+O7y9Ojx697z7Nfz7dPr687q4cvp3sfUu4fLqGH3xV/kvVDvu0TutULutD3otzvqrjjrrzfCkx/VlBbYlgvDgwT6/f37+vX39O/z8+Ls7tfs7NXs5NTu5c3lzJHmzIb803fkx3XOr3HkxWnjwF7ywlr1wljHoVP2z0vyxUjwukjyuETxuULCl0LvxkHstjvirjnprTXMmS7CjyvYpyrjpCbXsSXanCXHmSLpqh/PoxzboxfYnBfFlBbSkRTBixTgrRHenA/WmA6/gAWCjjfcAAAAXXRSTlMAE3MY4IAmJA4E/vvx58rHtZ+OjYBoXVg9NSgbEQf++/n38fDs6ufb29fU09LR0dDLy8jHxcO/u7qurq6uqainpqWShoSAf3lzbm1paWRgW1pUTktFRUI9OC0dFwoA/9kJAAABz0lEQVQoz3XPZUMqQRQGYJZQrGt71dvd3d3dfY3ZYgFhaVBEsLu7u7u745c5LDu278d55p0zRyARSgX75SB9N9h9P3xIA/HL30f2LtalAOB563XYHnb4ciwBYE5fD/i16/G3FEQuJ8R+AV/DoqSbA/4fV8RBRDkpvv3AP1AY/PGTE+/JEW5N+mOnvSfkioyd2LDw02mRZynYVG+jrKVzIm7ifQJi7NZmpn31uYCLRC2nKEUtlZZanVjp6WzZy/JfueyPNyGnFKaMUvtAV05Oa3b2WFlf0Rd+/StqiCZqvHzR4XBUrFVMFWiO/uVXfEarCcqSkjdjzbX2FpaM6Ej9qQjeJCqaqLFY8gydzbnW/kIdiesuHOLtOwOLSaZ2Q3xHfIKGxHFSfwDjzd0bFpOMbYYCSMU4NNmGSS8xKlplbDFoEvQynLMbyKL9mGQ62di0UiLDtS67iOYJ/M2MigGN5cVaLTQttDNuyALNDAMyRyd08JTkesf+IXtTZQb1pfP5SqVySAmj1wx/QyZMBKnTcz0sG8OFZdmid8g+gLTZ5W6bl8/Vm76+13y8bLbBRx6olz55/kVQSGi4CMMwUXhoSNDTO+gzn5/8ELnuoXi4Yev66rPXJeePIwAAAABJRU5ErkJggg=='),auto}
.注{font-weight:normal;color:var(--a-color);}
.注,a,a b{cursor:pointer}
#right_anchor,#right_anchor2{display:none !important}
i{font-style:italic;font-size:0.9em;transition:font-style 1s}i:hover,i:before,i:after{font-style:normal}i:before{content:"「"}i:after{content:" 」"}
.zhushi:after{content:" "}
span.lantie{color:#039BE5;}
.分{color:#BBBBBB}
.dk:after{content:"⤴️" !important}
h3{display:inline}
.红{color:#DA1801}.蓝{color:#039BE5}.绿{color:#0be503}.灰{color:var(--灰)}
[id^="隐藏"]{font-weight:normal}
.S{color:#ffc800;font-weight:bold}.A{color:#2977DB;font-weight:bold}.B{color:#8cbaf7}.C{color:#ff9488}.D{color:#ea4631}.E{color:#932213;font-weight:bold}
[onclick^="只看删除"]:hover{color:var(--灰);text-decoration:line-through}
a[onclick^="dw("]{font-size:0.85em;border: 1px solid #cfcfcf;padding:3px;border-radius:10px}
.提示 sub.详{display:none}.提示:hover sub.详{display:inline}.提示:hover{border:none}.提示 sub.详:before{content:"["}.提示 sub.详:after{content:"]"}
ol{line-height:2em}
ol ol li{counter-increment:customNumbers;list-style:none;}
ol ol li::before{content:counter(customNumbers)". ";font-size:0.8em;color:var(--灰)}
.首小1 tr:not(:nth-child(1)) td:nth-child(1),
.首小2 tr:not(:nth-child(1)) td:nth-child(2),
.首小3 tr:not(:nth-child(1)) td:nth-child(3){font-size:80%;}

li.★::marker{font-weight:bold;color:#ff0000;}
span.真{font-size:0.8em;color:#a8c5e2;}
span.假{font-size:0.8em;color:#e2a8a8;}

li.标题{position:relative;left:-1.2em;font-size:0.9em;color:#9d9d9d;margin:0.9em 0 0}
.标题::marker{color:#c3c3c3;font-size:0.8em;}
li.标题 span{font-size:1.1em;color:#8d0000}

@media screen and (min-width: 768px) { /*电脑*/
body{background-color:#F4F8FB;}
div.body{box-shadow: 2px 4px 8px #ddd;padding:20px;background-color:#fff;border-radius: 25px}
}
</style>`;}
}
加载('');加载('b');加载('c');

function 显示(o){document.getElementById("隐藏"+o).style="";document.getElementById("显示"+o).style="display:none"}
function 显示图片(o){o=o.split(",");o[1]="/i/o/yuanshen/"+o[1];document.getElementById("显示"+o[0]).innerHTML="<a href='"+o[1]+"' target='_blank'><img src='"+o[1]+"' width='"+o[2]+"'></a>"}

let 我只看="o";
function 只看(o){if(o==0){我只看="o"}else{只看删除(o);我只看+=","+o;只看b()}只看a()}
function 只看a(){if(我只看=="o"){document.getElementById("sty").innerHTML="";document.getElementById("只看已选").innerHTML="全部";document.getElementById("只看已选2").innerHTML="全部"}else{let 临时="";let 临时2=我只看.split(",");for(let i=0;临时2.length>i;i++){if(i!=0){临时+=","}临时+="li."+临时2[i]}document.getElementById("sty").innerHTML="<style>li[class]{display:none}"+临时+"{display:list-item}</style>"}}
function 只看b(){let 临时="<a onclick=\"只看(0)\">显示全部</a>（<b>已选：</b>";let 临时2=我只看.split(",");for(let i=1;临时2.length>i;i++){if(i!=1){临时+="、"}临时+="<a onclick=\"只看删除('"+临时2[i]+"')\">"+临时2[i]+"</a>"}document.getElementById("只看已选").innerHTML=临时+"）";document.getElementById("只看已选2").innerHTML=临时+"）"}
function 只看删除(o){我只看=我只看.split(",").filter(item=>item!==o).join(",");只看b();只看a()}
function 展开其他(o){document.getElementById("其他"+o).style="";document.getElementById("原其他"+o).style="display:none"}
function 排行高亮(o){document.getElementById(o.split("_")[0]+"_style").innerHTML="<style>."+o+"{background-color:#1A73E8;color:#ffffff}."+o+" a{color:#ffffff}</style>"}
// function 名词解释(){let 临时=document.getElementById("名词解释").value.toUpperCase();let 临时2="";if(注[临时]){if(注[临时][0]=="／"){临时2="<b>"+临时+"</b>：";临时=注[注[临时].split("／")[1]]}else{临时2="<b>"+临时+"</b>："}if(typeof 注[临时]=="object"){临时2+=注[临时][0]+" <a href='"+注[临时][1]+"'>链接</a>"}else{临时2+=注[临时]}}else{临时2="无相关内容"}document.getElementById("名词解释_").innerHTML=临时2}

if(window.location.href.indexOf("?")!=-1){let 临时=decodeURI(window.location.href.split("?")[1].split("#")[0]);只看(临时);window.location.href=window.location.href.split("#")[0]+"#只看特定内容"}