let dy,内容,分={},得分=[],粉丝=[],粉={},丝=[],获奖=[],事件={"全部":0};

let 替换=[
    ["i>”","i> ”"],
    ["。</i> ”","。</i>”"],
    ["〉〈","〉 〈"],
    ["”〈","” 〈"],
];
for(let i=4;6>i;i++){
    for(let i2=0;舆情[i].length>i2;i2++){
        if(舆情[3][i2][2]){
            舆情[i][舆情[i].length]=[舆情[3][i2][0],舆情[3][i2][i-2]]
        }else{
            break;
        }
    }
}
for(let i=3;6>i;i++){
    let 临时=[舆情[i][0]];
    for(let i2=1;舆情[i].length>i2;i2++){
        let 临时2=0;
        for(let i3=0;临时.length>i3;i3++){
            if(舆情[i][i2][1]>=临时[i3][1]){
                临时.splice(i3,0,舆情[i][i2]);
                临时2=1;
                break;
            }
        }
        if(临时2==0){
            临时[临时.length]=舆情[i][i2]
        }
    }
    舆情[i]=临时;
}

function 加载(o){
    if(o=="b"){
        内容=dy.split("〈");
    }else{
        内容=document.getElementById("内容").innerHTML;
        for(let i=0;替换.length>i;i++){
            内容=内容.replace(new RegExp(替换[i][0], "g"), 替换[i][1]);
        }
        内容=内容.split("〈");
    }
        dy=内容[0];
    for(let i=1;内容.length>i;i++){
        let 临时=内容[i].split("〉");
        let 临时2=临时[0].split("|");

    if(临时2[0]=="注"||临时2[0]=="注2"){
        if(临时2[2]){}else{临时2[2]="注"}
        dy+="<"+代码[临时2[0]]+" id='隐藏"+o+i+"' style='display:none;'>(";
        if(注[临时2[1]]){dy+=注[临时2[1]];}else{dy+=临时2[1];}
        dy+=")</"+代码[临时2[0]]+"><"+代码[临时2[0]]+" id='显示"+o+i+"' class='注' onclick=\"显示('"+o+i+"')\">["+临时2[2]+"]</"+代码[临时2[0]]+">";
    }
    if(临时2[0]=="隐藏"){
        if(临时2[2]){}else{临时2[2]="详情"}
        dy+="<span id='隐藏"+o+i+"' style='display:none;'><fieldset><legend>"+临时2[2]+"</legend>"+临时2[1]+"</fieldset></span><a id='显示"+o+i+"' onclick=\"显示('"+o+i+"')\">"+临时2[2]+"▿</a>";//🔻▼▾▽
    }
    if(临时2[0]=="相关"){
        dy+="<small id='相关"+o+i+"' class='注' onclick=\"相关('"+临时2[1]+"相关／"+o+i;
        if(临时2[2]){dy+="／"+临时2[2];
            if(注[临时2[1]+"相关"]){
                if(注[临时2[1]+"相关"].indexOf(临时2[2])!=-1){}else{注[临时2[1]+"相关"][注[临时2[1]+"相关"].length]=临时2[2];}
            }else{注[临时2[1]+"相关"]=[临时2[2]];}
        }
        dy+="')\">["+临时2[1]+"相关]</small>";
    }
    if(临时2[0]=="星"){dy+=代码[临时2[1]];}
    if(临时2[0]=="a"){dy+="<a name='"+临时2[1]+"'></a>";}
    if(临时2[0]=="标题"){
        if(临时2[2]){
            if(临时2[2]=="b"){
                dy+="<a name='"+临时2[1]+"'></a><b>"+临时2[1].split("_")[0]+"</b>";
            }else{
                dy+="<a name='"+临时2[2]+"'></a>"+临时2[1].split("_")[0];
            }
        }else{
            dy+="<a name='"+临时2[1]+"'></a>"+临时2[1].split("_")[0];
        }
    }
    if(临时2[0]=="http"||临时2[0]=="https"||临时2[0]=="/"||临时2[0]=="#"){
        if(临时2[0]=="http"||临时2[0]=="https"){临时2[0]+="://";}
        dy+="<a href='"+临时2[0]+临时2[1]+"'";
        if(临时2[0]!="#"){dy+=" target='_blank' class='dk'";}
        dy+=">"+临时2[2]+"</a>";
    }
    if(临时2[0]=="li"){
        if(临时2[1]){
            let 临时3=临时2[1].split(" ");
            for(let i2=0;临时3.length>i2;i2++){
                if(事件[临时3[i2]]){事件[临时3[i2]]+=1;}else{事件[临时3[i2]]=1;}
            }
        }else{临时2[1]=="";}
        事件["全部"]+=1;
        dy+="<li class='"+临时2[1]+"'>";
        }
    if(临时2[0]=="分"){
        if(得分.indexOf(临时2[1])!=-1){分[临时2[1]]+=临时2[2]*1;分[临时2[1]+"_次数"]+=1;}else{分[临时2[1]]=临时2[2]*1;分[临时2[1]+"_次数"]=1;得分[得分.length]=临时2[1];}
        dy+=" <sup class='分'>"+临时2[1]+临时2[2]+"</sup>";
        if(临时2[3]){dy+="［注［］"+临时2[3]+"［］评分原因］"}
    }
    if(临时2[0]=="粉丝"){
        粉丝[粉丝.length]=[临时2[1],临时2[2],临时2[3]];
        if(丝.indexOf(临时2[1])!=-1){粉[临时2[1]]=临时2[2].split("万")[0];}else{丝[丝.length]=临时2[1];粉[临时2[1]]=临时2[2].split("万")[0];}
        dy+="原神在"+临时2[1]+"粉丝数突破"+临时2[2]+"。";
    }
    if(临时2[0]=="获奖"){
        获奖[获奖.length]=[临时2[1],临时2[2],临时2[3]];
        dy+="荣获"+临时2[1]+"：<b>"+临时2[2]+"</b>";
    }
    if(临时2[0]=="table"){
        dy+="<table>";
        for(let i2=1;临时2.length>i2;i2++){
            dy+="<tr>";
            let 临时3=临时2[i2].split("／");
            for(let i3=0;临时3.length>i3;i3++){
                if(i3!=0){dy+="</td>";}
                dy+="<td>"+临时3[i3];
            }
            dy+="</td></tr>";
        }
        dy+="</table>";
    }
    if(临时2[0]=="zk"){
        if(!临时2[3]){临时2[3]=临时2[2];}
        if(window.location.href.indexOf("file:///")!=-1){dy+="<a href='留档/"+临时2[1]+".html'>"+临时2[2]+"</a>";}else{dy+="<a onclick=\"dw(dwb='"+临时2[1]+"',dwd='"+临时2[3]+"')\">"+临时2[2]+"</a>";}
    }
    if(临时2[0]=="dy"){
        if(临时2[1]=="粉丝"){
            dy+="<table><tr><td colspan='3'><b>粉丝数</b></td></tr>";
            for(let i2=0;粉丝.length>i2;i2++){
                dy+="<tr><td><small>"+粉丝[i2][2]+"</small></td><td>";
                if(粉[粉丝[i2][0]]+"万"==粉丝[i2][1]&&官号[粉丝[i2][0]]){
                    dy+="<a href='"+官号[粉丝[i2][0]]+"' target='_blank'>"+粉丝[i2][0]+"</a>";}else{dy+=粉丝[i2][0];}
                dy+="</td><td>";
                if(粉[粉丝[i2][0]]+"万"==粉丝[i2][1]){dy+="<b>"+粉丝[i2][1]+"</b>";}else{dy+=粉丝[i2][1];}
                dy+="</td></tr>";
            }
            粉["粉丝数"]=0;
            for(let i2=1;丝.length>i2;i2++){
                粉["粉丝数"]+=粉[丝[i2]]*1;
            }
            dy+="<tr><td colspan='3' style='text-align:right'><small>各平台 共</small> <b>"+粉["粉丝数"]+"万</b></td></tr></table>";
        }else if(临时2[1]=="获奖"){
            dy+="<table><tr><td><b>获奖</b></td><td>活动</td><td>奖项</td></tr>";
            for(let i2=0;获奖.length>i2;i2++){
                dy+="<tr><td><small>"+获奖[i2][2]+"</small></td><td>"+获奖[i2][0]+"</td><td>"+获奖[i2][1]+"</td></tr>";
            }
            dy+="</table>";
        }else if(临时2[1]=="总分"){
            dy+="<h4>总分</h4>";
            for(let i2=2;临时2.length>i2;i2++){
                let 临时3=临时2[i2].split(" ");
                dy+="<fieldset style='display:inline;'><legend>"+临时3[0]+" <small>"+临时3[1]+"</small></legend><small>评分次数:</small> "+分[临时3[0]+"_次数"]+"次 / <small>总分:</small> "+分[临时3[0]]+"分</fieldset><br>";
            }
        }else if(临时2[1]=="相关"){
            dy+=临时2[2]+" 〈相关|"+临时2[2]+"〉<br>";
        }else if(临时2[1]=="舆情调查"){
            let 临时3=舆情[0]+舆情[1]+舆情[2];
            dy+="有"+临时3+"人参与调查，其中"+舆情[0]+"人（"+(舆情[0]/临时3*100+"").split(".")[0]+"%）没玩过但听说过，"+舆情[1]+"人（"+(舆情[1]/临时3*100+"").split(".")[0]+"%）仅试玩过原神，"+舆情[2]+"人（"+(舆情[2]/临时3*100+"").split(".")[0]+"%）玩过很长时间。</small><br><br>"+
            "<b>“你认为原神抄袭了哪些作品？”</b>";
            dy+="<br>〈隐藏|<ol>";
            for(let i2=0;舆情[3].length>i2;i2++){
                dy+="<li><b>"+舆情[3][i2][0]+"</b> x"+舆情[3][i2][1]+"</li>";
            }
            dy+="</ol>|没玩过原神的网友〉<br>〈隐藏|<ol>";
            for(let i2=0;舆情[4].length>i2;i2++){
                dy+="<li><b>"+舆情[4][i2][0]+"</b> x"+舆情[4][i2][1]+"</li>";
            }
            dy+="</ol>|仅试玩过的网友〉<br>〈隐藏|<ol>";
            for(let i2=0;舆情[5].length>i2;i2++){
                dy+="<li><b>"+舆情[5][i2][0]+"</b> x"+舆情[5][i2][1]+"</li>";
            }
            dy+="</ol>|玩过很长时间〉<br>"+
            "<br><b>“你听说过以下关于原神的哪些事件？在听说过的事件里，你认为哪些是真的，哪些是假的？”</b><br>"+
            "<table style='line-height:1.2em;'><tr><td rowspan='2'></td><td colspan='3'>没玩过原神的网友</td><td rowspan='2'>&nbsp;</td><td colspan='3'>仅试玩过的网友</td><td rowspan='2'>&nbsp;</td><td colspan='3'>玩过很长时间</td></tr>"+
            "<tr><td><b>真的&nbsp;&nbsp;</b></td><td><b>假的</b></td><td><b>/ 没听过</b></td><td><b>真的&nbsp;&nbsp;</b></td><td><b>假的</b></td><td><b>/ 没听过</b></td><td><b>真的&nbsp;&nbsp;</b></td><td><b>假的</b></td><td><b>/ 没听过</b></td></tr>";

            for(let i2=6;舆情.length>i2;i2++){
                临时3=[舆情[0]-舆情[i2][2]-舆情[i2][3],舆情[1]-舆情[i2][4]-舆情[i2][5],舆情[2]-舆情[i2][6]-舆情[i2][7],
                舆情[i2][2]+舆情[i2][3],舆情[i2][4]+舆情[i2][5],舆情[i2][6]+舆情[i2][7]
            ];
                dy+="<tr><td>"+舆情[i2][0];
                // if(舆情[i2][1]!=""){dy+=" <a href='#"+舆情[i2][1]+"'><sub>跳转</sub></a>";}
                dy+="</td>"+
                "<td><b";if(舆情[i2][2]>舆情[i2][3]&&舆情[i2][2]!=0||舆情[i2][2]==舆情[i2][3]&&舆情[i2][2]>临时3[0]){dy+=" class='红'";}
                dy+=">"+(舆情[i2][2]/临时3[3]*100+"").split(".")[0]+"%</b><br><small>("+舆情[i2][2]+")</small></td>"+
                "<td><b";if(舆情[i2][3]>舆情[i2][2]&&舆情[i2][3]!=0||舆情[i2][3]==舆情[i2][2]&&舆情[i2][3]>临时3[0]){dy+=" class='红'";}
                dy+=">"+(舆情[i2][3]/临时3[3]*100+"").split(".")[0]+"%</b><br><small>("+舆情[i2][3]+")</small></td>"+
                "<td><b";if(临时3[0]>舆情[i2][2]&&临时3[0]>舆情[i2][3]){dy+=" class='蓝'";}
                dy+=">&nbsp;&nbsp;"+(临时3[0]/舆情[0]*100+"").split(".")[0]+"%</b><br>&nbsp;&nbsp;<small>("+临时3[0]+")</small></td>"+
                "<td></td>"+
                "<td><b";if(舆情[i2][4]>舆情[i2][5]&&舆情[i2][4]!=0||舆情[i2][4]==舆情[i2][5]&&舆情[i2][4]>临时3[1]){dy+=" class='红'";}
                dy+=">"+(舆情[i2][4]/临时3[4]*100+"").split(".")[0]+"%</b><br><small>("+舆情[i2][4]+")</small></td>"+
                "<td><b";if(舆情[i2][5]>舆情[i2][4]&&舆情[i2][5]!=0||舆情[i2][5]==舆情[i2][4]&&舆情[i2][5]>临时3[1]){dy+=" class='红'";}
                dy+=">"+(舆情[i2][5]/临时3[4]*100+"").split(".")[0]+"%</b><br><small>("+舆情[i2][5]+")</small></td>"+
                "<td><b";if(临时3[1]>舆情[i2][4]&&临时3[1]>舆情[i2][5]){dy+=" class='蓝'";}
                dy+=">&nbsp;&nbsp;"+(临时3[1]/舆情[1]*100+"").split(".")[0]+"%</b><br>&nbsp;&nbsp;<small>("+临时3[1]+")</small></td>"+
                "<td></td>"+
                "<td><b";if(舆情[i2][6]>舆情[i2][7]&&舆情[i2][6]!=0||舆情[i2][6]==舆情[i2][7]&&舆情[i2][6]>临时3[2]){dy+=" class='红'";}
                dy+=">"+(舆情[i2][6]/临时3[5]*100+"").split(".")[0]+"%</b><br><small>("+舆情[i2][6]+")</small></td>"+
                "<td><b";if(舆情[i2][7]>舆情[i2][6]&&舆情[i2][7]!=0||舆情[i2][7]==舆情[i2][6]&&舆情[i2][7]>临时3[2]){dy+=" class='红'";}
                dy+=">"+(舆情[i2][7]/临时3[5]*100+"").split(".")[0]+"%</b><br><small>("+舆情[i2][7]+")</small></td>"+
                "<td><b";if(临时3[2]>舆情[i2][6]&&临时3[2]>舆情[i2][7]){dy+=" class='蓝'";}
                dy+=">&nbsp;&nbsp;"+(临时3[2]/舆情[2]*100+"").split(".")[0]+"%</b><br>&nbsp;&nbsp;<small>("+临时3[2]+")</small></td>"+
                "</tr>";
            }
            dy+="</table>";
            dy+="〈隐藏|"+
                "<table style='line-height:1.2em;'><tr><td rowspan='2'></td><td colspan='3'>原神玩家</td><td rowspan='2'>&nbsp;</td><td colspan='3'>非原神玩家</td><td rowspan='2'>&nbsp;</td><td colspan='3'>所有调查对象</td></tr>"+
                "<tr><td><b>真的&nbsp;&nbsp;</b></td><td><b>假的</b></td><td><b>/ 没听过</b></td><td><b>真的&nbsp;&nbsp;</b></td><td><b>假的</b></td><td><b>/ 没听过</b></td><td><b>真的&nbsp;&nbsp;</b></td><td><b>假的</b></td><td><b>/ 没听过</b></td></tr>";
            for(let i2=6;舆情.length>i2;i2++){
                临时3[0]=舆情[0]+舆情[1];//非玩家总人数
                临时3[1]=临时3[0]+舆情[2];//所有调查对象
                临时3[2]=舆情[i2][2]+舆情[i2][4];//非玩家真
                临时3[3]=舆情[i2][3]+舆情[i2][5];//非玩家假
                临时3[4]=临时3[2]+舆情[i2][6];//所有人真
                临时3[5]=临时3[3]+舆情[i2][7];//所有人假
                临时3[6]=临时3[0]-舆情[i2][2]-舆情[i2][3]-舆情[i2][4]-舆情[i2][5];//非玩家没听过
                临时3[7]=临时3[1]-临时3[4]-临时3[5];//所有人没听过
                临时3[8]=舆情[2]-舆情[i2][6]-舆情[i2][7];//玩家没听过
                临时3[9]=舆情[i2][6]+舆情[i2][7];//玩家听说过
                临时3[10]=临时3[2]+临时3[3];//非玩家听说过
                临时3[11]=临时3[4]+临时3[5];//所有人听说过
                dy+="<tr><td>"+舆情[i2][0];
                // if(舆情[i2][1]!=""){dy+=" <a href='#"+舆情[i2][1]+"'><sub>跳转</sub></a>";}
                dy+="</td>"+
                "<td><b";if(舆情[i2][6]>舆情[i2][7]&&舆情[i2][6]!=0||舆情[i2][6]==舆情[i2][7]&&舆情[i2][6]>临时3[8]){dy+=" class='红'";}
                dy+=">"+(舆情[i2][6]/临时3[9]*100+"").split(".")[0]+"%</b><br><small>("+舆情[i2][6]+")</small></td>"+
                "<td><b";if(舆情[i2][7]>舆情[i2][6]&&舆情[i2][7]!=0||舆情[i2][7]==舆情[i2][6]&&舆情[i2][7]>临时3[8]){dy+=" class='红'";}
                dy+=">"+(舆情[i2][7]/临时3[9]*100+"").split(".")[0]+"%</b><br><small>("+舆情[i2][7]+")</small></td>"+
                "<td><b";if(临时3[8]>舆情[i2][6]&&临时3[8]>舆情[i2][7]){dy+=" class='蓝'";}
                dy+=">&nbsp;&nbsp;"+(临时3[8]/舆情[2]*100+"").split(".")[0]+"%</b><br>&nbsp;&nbsp;<small>("+临时3[8]+")</small></td>"+
                "<td></td>"+
                "<td><b";if(临时3[2]>临时3[3]&&临时3[2]!=0||临时3[2]==临时3[3]&&临时3[2]>临时3[0]){dy+=" class='红'";}
                dy+=">"+(临时3[2]/临时3[10]*100+"").split(".")[0]+"%</b><br><small>("+临时3[2]+")</small></td>"+
                "<td><b";if(临时3[3]>临时3[2]&&临时3[3]!=0||临时3[3]==临时3[2]&&临时3[3]>临时3[0]){dy+=" class='红'";}
                dy+=">"+(临时3[3]/临时3[10]*100+"").split(".")[0]+"%</b><br><small>("+临时3[3]+")</small></td>"+
                "<td><b";if(临时3[6]>临时3[2]&&临时3[6]>临时3[3]){dy+=" class='蓝'";}
                dy+=">&nbsp;&nbsp;"+(临时3[6]/临时3[0]*100+"").split(".")[0]+"%</b><br>&nbsp;&nbsp;<small>("+临时3[6]+")</small></td>"+
                "<td></td>"+
                "<td><b";if(临时3[4]>临时3[5]&&临时3[4]!=0||临时3[4]==临时3[5]&&临时3[4]>临时3[1]){dy+=" class='红'";}
                dy+=">"+(临时3[4]/临时3[11]*100+"").split(".")[0]+"%</b><br><small>("+临时3[4]+")</small></td>"+
                "<td><b";if(临时3[5]>临时3[4]&&临时3[5]!=0||临时3[5]==临时3[4]&&临时3[5]>临时3[1]){dy+=" class='红'";}
                dy+=">"+(临时3[5]/临时3[11]*100+"").split(".")[0]+"%</b><br><small>("+临时3[5]+")</small></td>"+
                "<td><b";if(临时3[7]>临时3[4]&&临时3[7]>临时3[5]){dy+=" class='蓝'";}
                dy+=">&nbsp;&nbsp;"+(临时3[7]/临时3[1]*100+"").split(".")[0]+"%</b><br>&nbsp;&nbsp;<small>("+临时3[7]+")</small></td>"+
                "</tr>";
            }
            dy+="</table>|<b>以“原神玩家/非原神玩家/所有调查对象”展示</b>〉<br>";
        }else if(临时2[1]=="新舆情"){
            for(let i2=0;新舆情.length>i2;i2++){
                let 临时3=[舆情[0]-新舆情[i2][2][0],舆情[1]-新舆情[i2][2][1],舆情[2]-新舆情[i2][2][2]];
                dy+="<h4>"+新舆情[i2][0]+"</h4>"+新舆情[i2][1]+"<br><table>";
                    for(let i3=3;7>i3;i3++){
                        dy+="<tr>";
                        if(i3==3){dy+="<td></td>";for(let i4=0;新舆情[i2][3].length>i4;i4++){dy+="<td><b>"+新舆情[i2][3][i4]+"</b></td>";}}
                        else{dy+="<td><b>"+代码["ta_"+i3]+"</b></td>";
                            for(let i4=0;新舆情[i2][i3].length>i4;i4++){
                                dy+="<td>"+(新舆情[i2][i3][i4]/临时3[i3-4]*100+"").split(".")[0]+"%<br><small>("+新舆情[i2][i3][i4]+")</small></td>";
                            }
                    }
                        dy+="</tr>";
                    }
                    dy+="</table>"
            }
        }else if(临时2[1]=="收藏"){
            for(let i2=0;收藏.length>i2;i2++){
                dy+="<br><h4>"+收藏[i2][0]+"</h4>";
                for(let i3=1;收藏[i2].length>i3;i3++){
                    dy+=代码["收藏"+i3]+"级<ol>";
                        for(let i4=0;收藏[i2][i3].length>i4;i4++){
                            dy+="<li><b>《"+收藏[i2][i3][i4][0]+"》</b><small>";
                                for(let i5=0;收藏[i2][i3][i4][1].length>i5;i5++){
                                    if(i5!=0){dy+=" · ";}
                                    let 临时3=收藏[i2][i3][i4][1][i5].split("／");
                                    dy+="<a href='"+临时3[0]+"' target='_blank'>";
                                        if(代码["收藏"+临时3[1]]){dy+=代码["收藏"+临时3[1]];}else{dy+=临时3[1];}
                                    dy+="</a>"
                                }
                            dy+="</small>";
                            if(收藏[i2][i3][i4][2]!=""){
                                dy+=" · · · "+收藏[i2][i3][i4][2];
                            }
                            dy+="</li>";
                        }
                    dy+="</ol>"
                }
            }
        }else if(临时2[1]=="事件"){
            dy+="<h4>事件数量</h4>";
            for(let i2=0;事件_只看.length>i2;i2++){
                if(事件_只看[i2][0]!="br"){dy+=事件_只看[i2][1]+"："+事件[事件_只看[i2][0]]+"（"+(事件[事件_只看[i2][0]]/事件["全部"]*100+"").split(".")[0]+"%）<br>";}
            }
        }else if(临时2[1]=="只看"){
            for(let i2=0;事件_只看.length-1>i2;i2++){
                if(事件_只看[i2][0]=="br"){dy+="<br>";}
                else{dy+="<a onclick=\"只看('"+事件_只看[i2][0]+"')\">"+事件_只看[i2][1]+"</a>　";}
            }
        }else{
            dy+=临时2[1];
        }
    }

    if(临时2[0]=="del"){dy+="<!--"+临时2[1]+"-->"}
    dy+=临时[1];
    }
    dy=dy.replace(new RegExp('［］', "g"), "|").replace(new RegExp('［', "g"), "〈").replace(new RegExp('］', "g"), "〉");
    if(o=="b"){document.getElementById("内容").innerHTML=dy;}
}
加载('');
加载('b');

function 相关(o){
    o=o.split("／");
    let 临时="";
    for(let i=0;注[o[0]].length>i;i++){
        if(o[2]&&注[o[0]][i]!=o[2]){
            临时+="　<a href='#"+注[o[0]][i]+"'>"+注[o[0]][i].split("_")[0]+"</a>";
        }else{临时+="　"+注[o[0]][i].split("_")[0];}
    }
    临时=临时.replace(new RegExp('^　', "g"), "");
    document.getElementById("相关"+o[1]).innerHTML="("+临时+")";
    document.getElementById("相关"+o[1]).className="";
}

function 显示(o){
    document.getElementById("隐藏"+o).style="";
    document.getElementById("显示"+o).style="display:none;";
}

let 我只看="o";
function 只看(o){
    if(o==0){
        我只看="o";
    }else{
        只看删除(o);
        我只看+=","+o;
        只看b();
    }
    只看a();
}
function 只看a(){
    if(我只看=="o"){
        document.getElementById("sty").innerHTML="";
        document.getElementById("只看已选").innerHTML="全部";
    }else{
        let 临时="";
        let 临时2=我只看.split(",");
        for(let i=0;临时2.length>i;i++){
            if(i!=0){临时+=",";}
            临时+="li."+临时2[i];
        }
        document.getElementById("sty").innerHTML="<style>li[class]{display:none;}"+临时+"{display:list-item;}</style>";
    }
}
function 只看b(){
    let 临时="<a onclick=\"只看(0)\">显示全部</a>（<b>已选：</b>";
    let 临时2=我只看.split(",");
        for(let i=1;临时2.length>i;i++){
            if(i!=1){临时+="、";}
            临时+="<a onclick=\"只看删除('"+临时2[i]+"')\">"+临时2[i]+"</a>";
        }
        document.getElementById("只看已选").innerHTML=临时+"）";
}
function 只看删除(o){
    我只看=我只看.replace(new RegExp(o, "g"), ",");
    我只看=我只看.replace(new RegExp(',,,', "g"), ",");
    我只看=我只看.replace(new RegExp(',,', "g"), "");
    只看b();只看a();
}