let A靶子 = new Date('146-6-21');
let A今天 = new Date();
A今天 = A今天 - A靶子;
let A天数 = Math.floor(A今天 / (24 * 3600 * 1000));
let A月;
let A年 = 4300 + parseInt(A天数/47619)*100;
	A天数 = A天数 % 47619;
let A结束=0;

if(A天数<476){ //00年
A月=parseInt(A天数/34)+1;
A天数=A天数%34+1;
A结束=1;}

if(A天数>475){ //其他情况
A天数=A天数-476;
A年=A年+1+parseInt(A天数/2381)*5;}
A天数=A天数%2381;

if(A天数>1903){ //闰年
A天数=A天数-1904;
A年=A年+4;
A结束=2;}

if(A天数==306 && A结束==2){
	A月=9;
	A天数=35;
	A结束=1;}

if(A天数>306 && A结束==2){
	A天数=A天数-307;
	A月=10+parseInt(A天数/34);
	A天数=A天数%34+1;
	A结束=1;}

if(A天数<306 && A结束==2){
	A月=1+parseInt(A天数/34);
	A天数=A天数%34+1;
	A结束=1;}

if(A结束==0){
	A年=A年+parseInt(A天数/476);
	A天数=A天数%476;
	A月=1+parseInt(A天数/34);
	A天数=1+A天数%34;}

//A年 A月 A日