/* 希尔历 */
let rlx = new Date('146-6-21');
let rlxa = new Date();
rlxa = rlxa - rlx;
var 希尔日 = Math.floor(rlxa / (24 * 3600 * 1000));
var 希尔月;
var 希尔年 = 4300 + parseInt(希尔日/47619)*100;
	希尔日 = 希尔日 % 47619;
let rlxend=0;
let 临时年;

if(希尔日<476){ //00年
    希尔月=parseInt(希尔日/34)+1;
    希尔日=希尔日%34+1;
    rlxend=1;
}

if(希尔日>475){ //其他情况
    希尔日=希尔日-476;
    希尔年=希尔年+1+parseInt(希尔日/2381)*5;
}

希尔日=希尔日%2381;

if(希尔日>1903){ //闰年
    希尔日=希尔日-1904;
    希尔年=希尔年+4;
    rlxend=2;
}

if(希尔日==306 && rlxend==2){
	希尔月=9;
	希尔日=35;
    rlxend=1;
}

if(希尔日>306 && rlxend==2){
	希尔日=希尔日-307;
	希尔月=10+parseInt(希尔日/34);
	希尔日=希尔日%34+1;
    rlxend=1;
}

if(希尔日<306 && rlxend==2){
	希尔月=1+parseInt(希尔日/34);
	希尔日=希尔日%34+1;
    rlxend=1;
}

if(rlxend==0){
	希尔年=希尔年+parseInt(希尔日/476);
	希尔日=希尔日%476;
	希尔月=1+parseInt(希尔日/34);
    希尔日=1+希尔日%34;
}

/* 盖亚历 阳历 */
var 盖亚年=new Date().getFullYear();
var 盖亚月=new Date().getMonth()+1;
var 盖亚日=new Date().getDate();
var 星期=new Date().getDay();
if (星期==0){星期=7;}
var 盖亚星期;
if (星期==1){盖亚星期="一";}
if (星期==2){盖亚星期="二";}
if (星期==3){盖亚星期="三";}
if (星期==4){盖亚星期="四";}
if (星期==5){盖亚星期="五";}
if (星期==6){盖亚星期="六";}
if (星期==7){盖亚星期="日";}

/* 阴历 */
let GetJson = $.ajax({
    url: "/5/rili/yl_nl/"+盖亚年+"/"+盖亚年+"."+盖亚月+"."+盖亚日+".json",//json文件位置
    type: "GET",
    dataType: "json",
    async: false,
    success: function (data) {
    }
});
let 临时农历=GetJson.responseText.split(".");
var cMonth=临时农历[0];
var cDay=临时农历[1];

var 农历月;
if (cMonth == 1){农历月="正";}
if (cMonth == 2){农历月="二";}
if (cMonth == 3){农历月="三";}
if (cMonth == 4){农历月="四";}
if (cMonth == 5){农历月="五";}
if (cMonth == 6){农历月="六";}
if (cMonth == 7){农历月="七";}
if (cMonth == 8){农历月="八";}
if (cMonth == 9){农历月="九";}
if (cMonth == 10){农历月="十";}
if (cMonth == 11){农历月="十一";}
if (cMonth == 12){农历月="腊";}

var 农历日 = cDay;
let 农历日计算;
if (农历日 == 30){农历日计算="三";农历日="十";}
if (农历日 == 20){农历日计算="廿";农历日="十";}
if (农历日 == 10){农历日计算="初";农历日="十";}
if (农历日 < 10){农历日计算="初";}
if (农历日 > 20){农历日计算="廿";农历日=农历日-20;}
if (农历日 > 10){农历日计算="十";农历日=农历日-10;}
if (农历日 == 1){农历日="一";}
if (农历日 == 2){农历日="二";}
if (农历日 == 3){农历日="三";}
if (农历日 == 4){农历日="四";}
if (农历日 == 5){农历日="五";}
if (农历日 == 6){农历日="六";}
if (农历日 == 7){农历日="七";}
if (农历日 == 8){农历日="八";}
if (农历日 == 9){农历日="九";}
农历日=农历日计算+农历日;

/* x月第x个星期x */
let 第x个=parseInt(盖亚日/7);
let 第y个=盖亚日%7;
if (第y个!=0){第x个=第x个+1;}
let 剩余天数 = new Date(盖亚年, 盖亚月, 0).getDate()-盖亚日+1;
let 倒数第x个=parseInt(剩余天数/7);
let 倒数第y个=剩余天数%7;
if (倒数第y个!=0){倒数第x个=倒数第x个+1;}

let 盖亚历=盖亚年+"年"+盖亚月+"月"+盖亚日+"日 星期"+盖亚星期;
let 农历=农历月+"月"+农历日;
let 希尔历=希尔年+"年"+希尔月+"月"+希尔日+"日";
var rili_日期="<b><a href=\"/riqijishi\">盖亚历</a></b> " + 盖亚历 + "<br/><b>农历</b> " + 农历 + "<br/><b>希尔历</b> " + 希尔历;
